spec/fixtures/subscriptions/notes-200-change.xml

HTTP/1.1 200 OK
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<subscription href="">
  <account href="https://api.recurly.com/v2/accounts/account_code"/>
  <plan href="https://api.recurly.com/v2/plans/plan_code">
    <plan_code>plan_code</plan_code>
    <name>A Man, a Plan, a Canal: Panama</name>
  </plan>
  <uuid>abcdef1234567890</uuid>
  <state>pending</state>
  <unit_amount_in_cents type="integer">1000</unit_amount_in_cents>
  <currency>USD</currency>
  <customer_notes>Some New Customer Notes</customer_notes>
  <terms_and_conditions>Some New Terms and Conditions</terms_and_conditions>
  <vat_reverse_charge_notes>Some New Vat Reverse Charge Notes</vat_reverse_charge_notes>
  <quantity type="integer">1</quantity>
  <activated_at nil="nil"></activated_at>
  <canceled_at nil="nil"></canceled_at>
  <expires_at nil="nil"></expires_at>
  <total_billing_cycles nil="nil"></total_billing_cycles>
  <remaining_billing_cycles nil="nil"></remaining_billing_cycles>
  <current_period_started_at type="datetime">2014-05-20T18:20:01Z</current_period_started_at>
  <current_period_ends_at type="datetime">2014-05-20T18:20:01Z</current_period_ends_at>
  <trial_started_at nil="nil"></trial_started_at>
  <trial_ends_at nil="nil"></trial_ends_at>
  <cost_in_cents type="integer">1000</cost_in_cents>
  <subscription_add_ons type="array">
  </subscription_add_ons>
</subscription>
