spec/fixtures/subscriptions/resume-200.xml

HTTP/1.1 200 OK
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<subscription href="https://api.recurly.com/v2/subscriptions/abcdef1234567890">
  <account href="https://api.recurly.com/v2/accounts/7747ed3b-1771-4a03-b32a-503e9d65d3ad"/>
  <shipping_address href="https://api.recurly.com/v2/accounts/7747ed3b-1771-4a03-b32a-503e9d65d3ad/shipping_addresses/2444483678776240546"/>
  <invoice href="https://api.recurly.com/v2/invoices/5333"/>
  <plan href="https://api.recurly.com/v2/plans/muwlysa6u3">
    <plan_code>muwlysa6u3</plan_code>
    <name>muWlYSa6U3</name>
  </plan>
  <revenue_schedule_type>evenly</revenue_schedule_type>
  <uuid>abcdef1234567890</uuid>
  <state>active</state>
  <unit_amount_in_cents type="integer">6</unit_amount_in_cents>
  <currency>USD</currency>
  <quantity type="integer">1</quantity>
  <activated_at type="datetime">2018-03-27T17:52:42Z</activated_at>
  <canceled_at nil="nil"></canceled_at>
  <expires_at nil="nil"></expires_at>
  <updated_at type="datetime">2018-03-27T17:58:14Z</updated_at>
  <total_billing_cycles nil="nil"></total_billing_cycles>
  <remaining_billing_cycles nil="nil"></remaining_billing_cycles>
  <current_period_started_at type="datetime">2018-03-27T17:52:42Z</current_period_started_at>
  <current_period_ends_at type="datetime">2019-04-27T17:52:42Z</current_period_ends_at>
  <trial_started_at nil="nil"></trial_started_at>
  <trial_ends_at nil="nil"></trial_ends_at>
  <terms_and_conditions nil="nil"></terms_and_conditions>
  <customer_notes nil="nil"></customer_notes>
  <started_with_gift type="boolean">false</started_with_gift>
  <converted_at nil="nil"></converted_at>
  <imported_trial type="boolean">false</imported_trial>
  <paused_at type="datetime">2019-04-27T17:52:42Z</paused_at>
  <remaining_pause_cycles nil="nil"/>
  <no_billing_info_reason></no_billing_info_reason>
  <po_number nil="nil"></po_number>
  <net_terms type="integer">0</net_terms>
  <collection_method>automatic</collection_method>
  <subscription_add_ons type="array">
  </subscription_add_ons>
  <a name="cancel" href="https://api.recurly.com/v2/subscriptions/abcdef1234567890/cancel" method="put"/>
  <a name="terminate" href="https://api.recurly.com/v2/subscriptions/abcdef1234567890/terminate" method="put"/>
  <a name="postpone" href="https://api.recurly.com/v2/subscriptions/abcdef1234567890/postpone" method="put"/>
  <a name="notes" href="https://api.recurly.com/v2/subscriptions/abcdef1234567890/notes" method="put"/>
</subscription>
